testCases/01_body_immersion_test_Case/F_creat_impeller_with_AMR/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    z1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       78300;
    }
    z0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       79200;
    }
    x1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       80100;
    }
    x0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       81000;
    }
    y0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       81900;
    }
    y1
    {
        type            patch;
        nFaces          900;
        startFace       82800;
    }
)

// ************************************************************************* //
